podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK20D7_100p.h
/****************************************************************************************************//**
 * @file     MK20D7.h
 *
 * @brief    CMSIS Cortex-M Peripheral Access Layer Header File for MK20D7.
 *           Equivalent: 
 *
 * @version  V1.6
 * @date     2021/11
 *
 *******************************************************************************************************/

#ifndef MCU_MK20D7
#define MCU_MK20D7

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/**
* @addtogroup Interrupt_vector_numbers_GROUP Interrupt vector numbers
* @brief Vector numbers required for NVIC functions
* @{
*/
/* -------------------------  Interrupt Number Definition  ------------------------ */

/**
 * Interrupt vector numbers
 */
typedef enum {
/* ------------------------  Processor Exceptions Numbers  ------------------------- */
  Reset_IRQn                    = -15,   /**<   1 Reset Vector, invoked on Power up and warm reset                                 */
  NonMaskableInt_IRQn           = -14,   /**<   2 Non maskable Interrupt, cannot be stopped or preempted                           */
  HardFault_IRQn                = -13,   /**<   3 Hard Fault, all classes of Fault                                                 */
  MemoryManagement_IRQn         = -12,   /**<   4 Memory Management, MPU mismatch, including Access Violation and No Match         */
  BusFault_IRQn                 = -11,   /**<   5 Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault   */
  UsageFault_IRQn               = -10,   /**<   6 Usage Fault, i.e. Undef Instruction, Illegal State Transition                    */
  SVCall_IRQn                   =  -5,   /**<  11 System Service Call via SVC instruction                                          */
  DebugMonitor_IRQn             =  -4,   /**<  12 Debug Monitor                                                                    */
  PendSV_IRQn                   =  -2,   /**<  14 Pendable request for system service                                              */
  SysTick_IRQn                  =  -1,   /**<  15 System Tick Timer                                                                */
/* ----------------------   MK20D7 VectorTable                       ---------------------- */
  DMA0_IRQn                     =   0,   /**<  16 Direct memory access controller                                                  */
  DMA1_IRQn                     =   1,   /**<  17 Direct memory access controller                                                  */
  DMA2_IRQn                     =   2,   /**<  18 Direct memory access controller                                                  */
  DMA3_IRQn                     =   3,   /**<  19 Direct memory access controller                                                  */
  DMA4_IRQn                     =   4,   /**<  20 Direct memory access controller                                                  */
  DMA5_IRQn                     =   5,   /**<  21 Direct memory access controller                                                  */
  DMA6_IRQn                     =   6,   /**<  22 Direct memory access controller                                                  */
  DMA7_IRQn                     =   7,   /**<  23 Direct memory access controller                                                  */
  DMA8_IRQn                     =   8,   /**<  24 Direct memory access controller                                                  */
  DMA9_IRQn                     =   9,   /**<  25 Direct memory access controller                                                  */
  DMA10_IRQn                    =  10,   /**<  26 Direct memory access controller                                                  */
  DMA11_IRQn                    =  11,   /**<  27 Direct memory access controller                                                  */
  DMA12_IRQn                    =  12,   /**<  28 Direct memory access controller                                                  */
  DMA13_IRQn                    =  13,   /**<  29 Direct memory access controller                                                  */
  DMA14_IRQn                    =  14,   /**<  30 Direct memory access controller                                                  */
  DMA15_IRQn                    =  15,   /**<  31 Direct memory access controller                                                  */
  DMA_Error_IRQn                =  16,   /**<  32 DMA error interrupt all channels                                                 */
  FTF_Command_IRQn              =  18,   /**<  34 Flash Memory Interface                                                           */
  FTF_ReadCollision_IRQn        =  19,   /**<  35 Flash Memory Interface                                                           */
  PMC_IRQn                      =  20,   /**<  36 Power Management Controller                                                      */
  LLWU_IRQn                     =  21,   /**<  37 Low Leakage Wakeup                                                               */
  WDOG_IRQn                     =  22,   /**<  38 External Watchdog Monitor                                                        */
  I2C0_IRQn                     =  24,   /**<  40 Inter-Integrated Circuit                                                         */
  I2C1_IRQn                     =  25,   /**<  41 Inter-Integrated Circuit                                                         */
  SPI0_IRQn                     =  26,   /**<  42 Serial Peripheral Interface                                                      */
  SPI1_IRQn                     =  27,   /**<  43 Serial Peripheral Interface                                                      */
  CAN0_MessageBuffer_IRQn       =  29,   /**<  45 Flex Controller Area Network module                                              */
  CAN0_BusOff_IRQn              =  30,   /**<  46 Flex Controller Area Network module                                              */
  CAN0_Error_IRQn               =  31,   /**<  47 Flex Controller Area Network module                                              */
  CAN0_TxWarning_IRQn           =  32,   /**<  48 Flex Controller Area Network module                                              */
  CAN0_RxWarning_IRQn           =  33,   /**<  49 Flex Controller Area Network module                                              */
  CAN0_WakeUp_IRQn              =  34,   /**<  50 Flex Controller Area Network module                                              */
  I2S0_Tx_IRQn                  =  35,   /**<  51 Synchronous Serial Interface                                                     */
  I2S0_Rx_IRQn                  =  36,   /**<  52 Synchronous Serial Interface                                                     */
  UART0_Lon_IRQn                =  44,   /**<  60 Serial Communication Interface                                                   */
  UART0_RxTx_IRQn               =  45,   /**<  61 Serial Communication Interface                                                   */
  UART0_Error_IRQn              =  46,   /**<  62 Serial Communication Interface                                                   */
  UART1_RxTx_IRQn               =  47,   /**<  63 Serial Communication Interface                                                   */
  UART1_Error_IRQn              =  48,   /**<  64 Serial Communication Interface                                                   */
  UART2_RxTx_IRQn               =  49,   /**<  65 Serial Communication Interface                                                   */
  UART2_Error_IRQn              =  50,   /**<  66 Serial Communication Interface                                                   */
  UART3_RxTx_IRQn               =  51,   /**<  67 Serial Communication Interface                                                   */
  UART3_Error_IRQn              =  52,   /**<  68 Serial Communication Interface                                                   */
  UART4_RxTx_IRQn               =  53,   /**<  69 Serial Communication Interface                                                   */
  UART4_Error_IRQn              =  54,   /**<  70 Serial Communication Interface                                                   */
  ADC0_IRQn                     =  57,   /**<  73 Analogue to Digital Converter                                                    */
  ADC1_IRQn                     =  58,   /**<  74 Analogue to Digital Converter                                                    */
  CMP0_IRQn                     =  59,   /**<  75 High-Speed Comparator                                                            */
  CMP1_IRQn                     =  60,   /**<  76 High-Speed Comparator                                                            */
  CMP2_IRQn                     =  61,   /**<  77 High-Speed Comparator                                                            */
  FTM0_IRQn                     =  62,   /**<  78 FlexTimer Module                                                                 */
  FTM1_IRQn                     =  63,   /**<  79 FlexTimer Module                                                                 */
  FTM2_IRQn                     =  64,   /**<  80 FlexTimer Module                                                                 */
  CMT_IRQn                      =  65,   /**<  81 Carrier Modulator Transmitter                                                    */
  RTC_Alarm_IRQn                =  66,   /**<  82 Real Time Clock                                                                  */
  RTC_Seconds_IRQn              =  67,   /**<  83 Real Time Clock                                                                  */
  PIT0_IRQn                     =  68,   /**<  84 Periodic Interrupt Timer                                                         */
  PIT1_IRQn                     =  69,   /**<  85 Periodic Interrupt Timer                                                         */
  PIT2_IRQn                     =  70,   /**<  86 Periodic Interrupt Timer                                                         */
  PIT3_IRQn                     =  71,   /**<  87 Periodic Interrupt Timer                                                         */
  PDB0_IRQn                     =  72,   /**<  88 Programmable Delay Block                                                         */
  USB0_IRQn                     =  73,   /**<  89 Universal Serial Bus                                                             */
  USBDCD0_IRQn                  =  74,   /**<  90 USB Device Charger Detection                                                     */
  DAC0_IRQn                     =  81,   /**<  97 Digital to Analogue Converter                                                    */
  TSI0_IRQn                     =  83,   /**<  99 Touch Sense Interface                                                            */
  MCG_IRQn                      =  84,   /**< 100 Multipurpose Clock Generator                                                     */
  LPTMR0_IRQn                   =  85,   /**< 101 Low Power Timer                                                                  */
  PORTA_IRQn                    =  87,   /**< 103 General Purpose Input/Output                                                     */
  PORTB_IRQn                    =  88,   /**< 104 General Purpose Input/Output                                                     */
  PORTC_IRQn                    =  89,   /**< 105 General Purpose Input/Output                                                     */
  PORTD_IRQn                    =  90,   /**< 106 General Purpose Input/Output                                                     */
  PORTE_IRQn                    =  91,   /**< 107 General Purpose Input/Output                                                     */
  SWI_IRQn                      =  94,   /**< 110 Software interrupt                                                               */
} IRQn_Type;

/**
 * @} */ /* End group Interrupt_vector_numbers_GROUP 
 */
/**
* @addtogroup Interrupt_handler_prototypes_GROUP Interrupt handler prototypes
* @brief Prototypes for interrupt handlers
* @{
*/
/* -------------------------  Exception Handlers  ------------------------ */
extern void NMI_Handler(void);                       /**< Non maskable Interrupt, cannot be stopped or preempted                           */
extern void HardFault_Handler(void);                 /**< Hard Fault, all classes of Fault                                                 */
extern void MemManage_Handler(void);                 /**< Memory Management, MPU mismatch, including Access Violation and No Match         */
extern void BusFault_Handler(void);                  /**< Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault   */
extern void UsageFault_Handler(void);                /**< Usage Fault, i.e. Undef Instruction, Illegal State Transition                    */
extern void SVC_Handler(void);                       /**< System Service Call via SVC instruction                                          */
extern void DebugMon_Handler(void);                  /**< Debug Monitor                                                                    */
extern void PendSV_Handler(void);                    /**< Pendable request for system service                                              */
extern void SysTick_Handler(void);                   /**< System Tick Timer                                                                */
extern void DMA0_IRQHandler(void);                   /**< Direct memory access controller                                                  */
extern void DMA1_IRQHandler(void);                   /**< Direct memory access controller                                                  */
extern void DMA2_IRQHandler(void);                   /**< Direct memory access controller                                                  */
extern void DMA3_IRQHandler(void);                   /**< Direct memory access controller                                                  */
extern void DMA4_IRQHandler(void);                   /**< Direct memory access controller                                                  */
extern void DMA5_IRQHandler(void);                   /**< Direct memory access controller                                                  */
extern void DMA6_IRQHandler(void);                   /**< Direct memory access controller                                                  */
extern void DMA7_IRQHandler(void);                   /**< Direct memory access controller                                                  */
extern void DMA8_IRQHandler(void);                   /**< Direct memory access controller                                                  */
extern void DMA9_IRQHandler(void);                   /**< Direct memory access controller                                                  */
extern void DMA10_IRQHandler(void);                  /**< Direct memory access controller                                                  */
extern void DMA11_IRQHandler(void);                  /**< Direct memory access controller                                                  */
extern void DMA12_IRQHandler(void);                  /**< Direct memory access controller                                                  */
extern void DMA13_IRQHandler(void);                  /**< Direct memory access controller                                                  */
extern void DMA14_IRQHandler(void);                  /**< Direct memory access controller                                                  */
extern void DMA15_IRQHandler(void);                  /**< Direct memory access controller                                                  */
extern void DMA_Error_IRQHandler(void);              /**< DMA error interrupt all channels                                                 */
extern void FTF_Command_IRQHandler(void);            /**< Flash Memory Interface                                                           */
extern void FTF_ReadCollision_IRQHandler(void);      /**< Flash Memory Interface                                                           */
extern void PMC_IRQHandler(void);                    /**< Power Management Controller                                                      */
extern void LLWU_IRQHandler(void);                   /**< Low Leakage Wakeup                                                               */
extern void WDOG_IRQHandler(void);                   /**< External Watchdog Monitor                                                        */
extern void I2C0_IRQHandler(void);                   /**< Inter-Integrated Circuit                                                         */
extern void I2C1_IRQHandler(void);                   /**< Inter-Integrated Circuit                                                         */
extern void SPI0_IRQHandler(void);                   /**< Serial Peripheral Interface                                                      */
extern void SPI1_IRQHandler(void);                   /**< Serial Peripheral Interface                                                      */
extern void CAN0_MessageBuffer_IRQHandler(void);     /**< Flex Controller Area Network module                                              */
extern void CAN0_BusOff_IRQHandler(void);            /**< Flex Controller Area Network module                                              */
extern void CAN0_Error_IRQHandler(void);             /**< Flex Controller Area Network module                                              */
extern void CAN0_TxWarning_IRQHandler(void);         /**< Flex Controller Area Network module                                              */
extern void CAN0_RxWarning_IRQHandler(void);         /**< Flex Controller Area Network module                                              */
extern void CAN0_WakeUp_IRQHandler(void);            /**< Flex Controller Area Network module                                              */
extern void I2S0_Tx_IRQHandler(void);                /**< Synchronous Serial Interface                                                     */
extern void I2S0_Rx_IRQHandler(void);                /**< Synchronous Serial Interface                                                     */
extern void UART0_Lon_IRQHandler(void);              /**< Serial Communication Interface                                                   */
extern void UART0_RxTx_IRQHandler(void);             /**< Serial Communication Interface                                                   */
extern void UART0_Error_IRQHandler(void);            /**< Serial Communication Interface                                                   */
extern void UART1_RxTx_IRQHandler(void);             /**< Serial Communication Interface                                                   */
extern void UART1_Error_IRQHandler(void);            /**< Serial Communication Interface                                                   */
extern void UART2_RxTx_IRQHandler(void);             /**< Serial Communication Interface                                                   */
extern void UART2_Error_IRQHandler(void);            /**< Serial Communication Interface                                                   */
extern void UART3_RxTx_IRQHandler(void);             /**< Serial Communication Interface                                                   */
extern void UART3_Error_IRQHandler(void);            /**< Serial Communication Interface                                                   */
extern void UART4_RxTx_IRQHandler(void);             /**< Serial Communication Interface                                                   */
extern void UART4_Error_IRQHandler(void);            /**< Serial Communication Interface                                                   */
extern void ADC0_IRQHandler(void);                   /**< Analogue to Digital Converter                                                    */
extern void ADC1_IRQHandler(void);                   /**< Analogue to Digital Converter                                                    */
extern void CMP0_IRQHandler(void);                   /**< High-Speed Comparator                                                            */
extern void CMP1_IRQHandler(void);                   /**< High-Speed Comparator                                                            */
extern void CMP2_IRQHandler(void);                   /**< High-Speed Comparator                                                            */
extern void FTM0_IRQHandler(void);                   /**< FlexTimer Module                                                                 */
extern void FTM1_IRQHandler(void);                   /**< FlexTimer Module                                                                 */
extern void FTM2_IRQHandler(void);                   /**< FlexTimer Module                                                                 */
extern void CMT_IRQHandler(void);                    /**< Carrier Modulator Transmitter                                                    */
extern void RTC_Alarm_IRQHandler(void);              /**< Real Time Clock                                                                  */
extern void RTC_Seconds_IRQHandler(void);            /**< Real Time Clock                                                                  */
extern void PIT0_IRQHandler(void);                   /**< Periodic Interrupt Timer                                                         */
extern void PIT1_IRQHandler(void);                   /**< Periodic Interrupt Timer                                                         */
extern void PIT2_IRQHandler(void);                   /**< Periodic Interrupt Timer                                                         */
extern void PIT3_IRQHandler(void);                   /**< Periodic Interrupt Timer                                                         */
extern void PDB0_IRQHandler(void);                   /**< Programmable Delay Block                                                         */
extern void USB0_IRQHandler(void);                   /**< Universal Serial Bus                                                             */
extern void USBDCD0_IRQHandler(void);                /**< USB Device Charger Detection                                                     */
extern void DAC0_IRQHandler(void);                   /**< Digital to Analogue Converter                                                    */
extern void TSI0_IRQHandler(void);                   /**< Touch Sense Interface                                                            */
extern void MCG_IRQHandler(void);                    /**< Multipurpose Clock Generator                                                     */
extern void LPTMR0_IRQHandler(void);                 /**< Low Power Timer                                                                  */
extern void PORTA_IRQHandler(void);                  /**< General Purpose Input/Output                                                     */
extern void PORTB_IRQHandler(void);                  /**< General Purpose Input/Output                                                     */
extern void PORTC_IRQHandler(void);                  /**< General Purpose Input/Output                                                     */
extern void PORTD_IRQHandler(void);                  /**< General Purpose Input/Output                                                     */
extern void PORTE_IRQHandler(void);                  /**< General Purpose Input/Output                                                     */
extern void SWI_IRQHandler(void);                    /**< Software interrupt                                                               */

