podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK20D7_100p.h
#define AIPS_PACR_SP0(x)                         (((uint32_t)(((uint32_t)(x))<<30U))&0x40000000UL)   /*!< AIPS0_PACR.SP0 Field                    */
/**
 * @} */ /* End group AIPS_Register_Masks_GROUP 
 */

/* AIPS0 - Peripheral instance base addresses */
#define AIPS0_BasePtr                  0x40000000UL //!< Peripheral base address
#define AIPS0                          ((AIPS_Type *) AIPS0_BasePtr) //!< Freescale base pointer
#define AIPS0_BASE_PTR                 (AIPS0) //!< Freescale style base pointer
/**
 * @} */ /* End group AIPS_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup AIPS_Peripheral_access_layer_GROUP AIPS Peripheral Access Layer
* @brief C Struct for AIPS
* @{
*/

/* ================================================================================ */
/* ================           AIPS1 (derived from AIPS0)           ================ */
/* ================================================================================ */

/**
 * @brief AIPS-Lite Bridge
 */

/* AIPS1 - Peripheral instance base addresses */
#define AIPS1_BasePtr                  0x40080000UL //!< Peripheral base address
#define AIPS1                          ((AIPS_Type *) AIPS1_BasePtr) //!< Freescale base pointer
#define AIPS1_BASE_PTR                 (AIPS1) //!< Freescale style base pointer
/**
 * @} */ /* End group AIPS_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup AXBS_Peripheral_access_layer_GROUP AXBS Peripheral Access Layer
* @brief C Struct for AXBS
* @{
*/

/* ================================================================================ */
/* ================           AXBS (file:AXBS_4M_4S)               ================ */
/* ================================================================================ */

/**
 * @brief Crossbar switch
 */
/**
* @addtogroup AXBS_structs_GROUP AXBS struct
* @brief Struct for AXBS
* @{
*/
typedef struct AXBS_Type {
   struct {
      __IO uint32_t  PRS;                       /**< 0000: Priority Registers Slave                                     */
           uint8_t   RESERVED_0[12];            /**< 0004: 0xC bytes                                                    */
      __IO uint32_t  CRS;                       /**< 0010: Control Register                                             */
           uint8_t   RESERVED_1[236];           /**< 0014: 0xEC bytes                                                   */
   } SLAVE[4];                                  /**< 0000: (cluster: size=0x0400, 1024)                                 */
        uint8_t   RESERVED_2[1024];             /**< 0400: 0x400 bytes                                                  */
   __IO uint32_t  MGPCR0;                       /**< 0800: Master General Purpose Control Register                      */
        uint8_t   RESERVED_3[252];              /**< 0804: 0xFC bytes                                                   */
   __IO uint32_t  MGPCR1;                       /**< 0900: Master General Purpose Control Register                      */
        uint8_t   RESERVED_4[252];              /**< 0904: 0xFC bytes                                                   */
   __IO uint32_t  MGPCR2;                       /**< 0A00: Master General Purpose Control Register                      */
        uint8_t   RESERVED_5[252];              /**< 0A04: 0xFC bytes                                                   */
   __IO uint32_t  MGPCR3;                       /**< 0B00: Master General Purpose Control Register                      */
} AXBS_Type;

/**
 * @} */ /* End group AXBS_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'AXBS' Position & Mask macros                        ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup AXBS_Register_Masks_GROUP AXBS Register Masks
* @brief Register Masks for AXBS
* @{
*/
/* ------- PRS Bit Fields                           ------ */
#define AXBS_PRS_M0_MASK                         (0x7U)                                              /*!< AXBS_PRS.M0 Mask                        */
#define AXBS_PRS_M0_SHIFT                        (0U)                                                /*!< AXBS_PRS.M0 Position                    */
#define AXBS_PRS_M0(x)                           (((uint32_t)(((uint32_t)(x))<<0U))&0x7UL)           /*!< AXBS_PRS.M0 Field                       */
#define AXBS_PRS_M1_MASK                         (0x70U)                                             /*!< AXBS_PRS.M1 Mask                        */
#define AXBS_PRS_M1_SHIFT                        (4U)                                                /*!< AXBS_PRS.M1 Position                    */
#define AXBS_PRS_M1(x)                           (((uint32_t)(((uint32_t)(x))<<4U))&0x70UL)          /*!< AXBS_PRS.M1 Field                       */
#define AXBS_PRS_M2_MASK                         (0x700U)                                            /*!< AXBS_PRS.M2 Mask                        */
#define AXBS_PRS_M2_SHIFT                        (8U)                                                /*!< AXBS_PRS.M2 Position                    */
#define AXBS_PRS_M2(x)                           (((uint32_t)(((uint32_t)(x))<<8U))&0x700UL)         /*!< AXBS_PRS.M2 Field                       */
#define AXBS_PRS_M3_MASK                         (0x7000U)                                           /*!< AXBS_PRS.M3 Mask                        */
#define AXBS_PRS_M3_SHIFT                        (12U)                                               /*!< AXBS_PRS.M3 Position                    */
#define AXBS_PRS_M3(x)                           (((uint32_t)(((uint32_t)(x))<<12U))&0x7000UL)       /*!< AXBS_PRS.M3 Field                       */
#define AXBS_PRS_M4_MASK                         (0x70000U)                                          /*!< AXBS_PRS.M4 Mask                        */
#define AXBS_PRS_M4_SHIFT                        (16U)                                               /*!< AXBS_PRS.M4 Position                    */
#define AXBS_PRS_M4(x)                           (((uint32_t)(((uint32_t)(x))<<16U))&0x70000UL)      /*!< AXBS_PRS.M4 Field                       */
#define AXBS_PRS_M5_MASK                         (0x700000U)                                         /*!< AXBS_PRS.M5 Mask                        */
#define AXBS_PRS_M5_SHIFT                        (20U)                                               /*!< AXBS_PRS.M5 Position                    */
#define AXBS_PRS_M5(x)                           (((uint32_t)(((uint32_t)(x))<<20U))&0x700000UL)     /*!< AXBS_PRS.M5 Field                       */
/* ------- CRS Bit Fields                           ------ */
#define AXBS_CRS_PARK_MASK                       (0x7U)                                              /*!< AXBS_CRS.PARK Mask                      */
#define AXBS_CRS_PARK_SHIFT                      (0U)                                                /*!< AXBS_CRS.PARK Position                  */
#define AXBS_CRS_PARK(x)                         (((uint32_t)(((uint32_t)(x))<<0U))&0x7UL)           /*!< AXBS_CRS.PARK Field                     */
#define AXBS_CRS_PCTL_MASK                       (0x30U)                                             /*!< AXBS_CRS.PCTL Mask                      */
#define AXBS_CRS_PCTL_SHIFT                      (4U)                                                /*!< AXBS_CRS.PCTL Position                  */
#define AXBS_CRS_PCTL(x)                         (((uint32_t)(((uint32_t)(x))<<4U))&0x30UL)          /*!< AXBS_CRS.PCTL Field                     */
#define AXBS_CRS_ARB_MASK                        (0x300U)                                            /*!< AXBS_CRS.ARB Mask                       */
#define AXBS_CRS_ARB_SHIFT                       (8U)                                                /*!< AXBS_CRS.ARB Position                   */
#define AXBS_CRS_ARB(x)                          (((uint32_t)(((uint32_t)(x))<<8U))&0x300UL)         /*!< AXBS_CRS.ARB Field                      */
#define AXBS_CRS_HLP_MASK                        (0x40000000U)                                       /*!< AXBS_CRS.HLP Mask                       */
#define AXBS_CRS_HLP_SHIFT                       (30U)                                               /*!< AXBS_CRS.HLP Position                   */
#define AXBS_CRS_HLP(x)                          (((uint32_t)(((uint32_t)(x))<<30U))&0x40000000UL)   /*!< AXBS_CRS.HLP Field                      */
#define AXBS_CRS_RO_MASK                         (0x80000000U)                                       /*!< AXBS_CRS.RO Mask                        */
#define AXBS_CRS_RO_SHIFT                        (31U)                                               /*!< AXBS_CRS.RO Position                    */
#define AXBS_CRS_RO(x)                           (((uint32_t)(((uint32_t)(x))<<31U))&0x80000000UL)   /*!< AXBS_CRS.RO Field                       */
/* ------- MGPCR0 Bit Fields                        ------ */
#define AXBS_MGPCR0_AULB_MASK                    (0x7U)                                              /*!< AXBS_MGPCR0.AULB Mask                   */
#define AXBS_MGPCR0_AULB_SHIFT                   (0U)                                                /*!< AXBS_MGPCR0.AULB Position               */
#define AXBS_MGPCR0_AULB(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0x7UL)           /*!< AXBS_MGPCR0.AULB Field                  */
/* ------- MGPCR1 Bit Fields                        ------ */
#define AXBS_MGPCR1_AULB_MASK                    (0x7U)                                              /*!< AXBS_MGPCR1.AULB Mask                   */
#define AXBS_MGPCR1_AULB_SHIFT                   (0U)                                                /*!< AXBS_MGPCR1.AULB Position               */
#define AXBS_MGPCR1_AULB(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0x7UL)           /*!< AXBS_MGPCR1.AULB Field                  */
/* ------- MGPCR2 Bit Fields                        ------ */
#define AXBS_MGPCR2_AULB_MASK                    (0x7U)                                              /*!< AXBS_MGPCR2.AULB Mask                   */
#define AXBS_MGPCR2_AULB_SHIFT                   (0U)                                                /*!< AXBS_MGPCR2.AULB Position               */
#define AXBS_MGPCR2_AULB(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0x7UL)           /*!< AXBS_MGPCR2.AULB Field                  */
/* ------- MGPCR3 Bit Fields                        ------ */
#define AXBS_MGPCR3_AULB_MASK                    (0x7U)                                              /*!< AXBS_MGPCR3.AULB Mask                   */
#define AXBS_MGPCR3_AULB_SHIFT                   (0U)                                                /*!< AXBS_MGPCR3.AULB Position               */
#define AXBS_MGPCR3_AULB(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0x7UL)           /*!< AXBS_MGPCR3.AULB Field                  */
/**
 * @} */ /* End group AXBS_Register_Masks_GROUP 
 */

/* AXBS - Peripheral instance base addresses */
#define AXBS_BasePtr                   0x40004000UL //!< Peripheral base address
#define AXBS                           ((AXBS_Type *) AXBS_BasePtr) //!< Freescale base pointer
#define AXBS_BASE_PTR                  (AXBS) //!< Freescale style base pointer
/**
 * @} */ /* End group AXBS_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup CAN_Peripheral_access_layer_GROUP CAN Peripheral Access Layer
* @brief C Struct for CAN
* @{
*/

/* ================================================================================ */
/* ================           CAN0 (file:CAN0_FLEX_MK)             ================ */
/* ================================================================================ */

/**
 * @brief Flex Controller Area Network module
 */
#define CAN_FIFO_FILTER_COUNT 40        /**< Number of Filter IDs                               */
#define CAN_MESSAGE_BUFFER_COUNT 16     /**< Number of message buffers                          */
/**
* @addtogroup CAN_structs_GROUP CAN struct
* @brief Struct for CAN
* @{
*/
typedef struct CAN_Type {
   __IO uint32_t  MCR;                          /**< 0000: Module Configuration Register                                */
   __IO uint32_t  CTRL1;                        /**< 0004: Control 1 Register                                           */
   __IO uint32_t  TIMER;                        /**< 0008: Free Running Timer                                           */
        uint8_t   RESERVED_0[4];                /**< 000C: 0x4 bytes                                                    */
   __IO uint32_t  RXMGMASK;                     /**< 0010: Rx Mailboxes Global Mask Register                            */
   __IO uint32_t  RX14MASK;                     /**< 0014: Rx 14 Mask register                                          */
   __IO uint32_t  RX15MASK;                     /**< 0018: Rx 15 Mask register                                          */
   __IO uint32_t  ECR;                          /**< 001C: Error Counter                                                */
   __IO uint32_t  ESR1;                         /**< 0020: Error and Status 1 register                                  */
        uint8_t   RESERVED_1[4];                /**< 0024: 0x4 bytes                                                    */
   __IO uint32_t  IMASK1;                       /**< 0028: Interrupt Masks 1 register                                   */
        uint8_t   RESERVED_2[4];                /**< 002C: 0x4 bytes                                                    */
   __IO uint32_t  IFLAG1;                       /**< 0030: Interrupt Flags 1 register                                   */
   __IO uint32_t  CTRL2;                        /**< 0034: Control 2 Register                                           */
   __I  uint32_t  ESR2;                         /**< 0038: Error and Status 2 register                                  */
        uint8_t   RESERVED_3[8];                /**< 003C: 0x8 bytes                                                    */
   __I  uint32_t  CRCR;                         /**< 0044: CRC Register                                                 */
   union {                                      /**< 0048: (size=0004)                                                  */
      __IO uint32_t  RXFGMASK;                  /**< 0048: Rx FIFO Global Mask register                                 */
      __IO uint32_t  RXFGMASK_A;                /**< 0048: Rx FIFO Global Mask register (format A)                      */
      __IO uint32_t  RXFGMASK_B;                /**< 0048: Rx FIFO Global Mask register (format B)                      */
      __IO uint32_t  RXFGMASK_C;                /**< 0048: Rx FIFO Global Mask register (format C)                      */
   };
   __I  uint32_t  RXFIR;                        /**< 004C: Rx FIFO Information Register                                 */
        uint8_t   RESERVED_4[48];               /**< 0050: 0x30 bytes                                                   */
   union {                                      /**< 0080: (size=0100)                                                  */
      struct {
         __IO uint32_t  CS;                     /**< 0080: FIFO Message Buffer CS Register                              */
         __IO uint32_t  ID;                     /**< 0084: FIFO Message Buffer ID Register                              */
         __IO uint32_t  WORD0;                  /**< 0088: FIFO Message Buffer WORD0 Register                           */
         __IO uint32_t  WORD1;                  /**< 008C: FIFO Message Buffer WORD1 Register                           */
              uint8_t   RESERVED_5[80];         /**< 0090: 0x50 bytes                                                   */
         union {                                /**< 00E0: (size=00A0)                                                  */
            __IO uint32_t  FILTER_ID[CAN_FIFO_FILTER_COUNT]; /**< 00E0: FIFO Message Filter ID                                       */
            __IO uint32_t  FILTER_ID_A[CAN_FIFO_FILTER_COUNT]; /**< 00E0: FIFO Message Filter ID (format A)                            */
            __IO uint32_t  FILTER_ID_B[CAN_FIFO_FILTER_COUNT]; /**< 00E0: FIFO Message Filter ID (format B)                            */
            __IO uint32_t  FILTER_ID_C[CAN_FIFO_FILTER_COUNT]; /**< 00E0: FIFO Message Filter ID (format C)                            */
         };
      } FIFO;                                   /**< 0080: (cluster: size=0x0100, 256)                                  */
      struct {
         __IO uint32_t  CS;                     /**< 0080: Message Buffer 0 CS Register                                 */
         __IO uint32_t  ID;                     /**< 0084: Message Buffer 0 ID Register                                 */
         __IO uint32_t  WORD0;                  /**< 0088: Message Buffer 0 WORD0 Register                              */
         __IO uint32_t  WORD1;                  /**< 008C: Message Buffer 0 WORD1 Register                              */
      } MB[CAN_MESSAGE_BUFFER_COUNT];           /**< 0080: (cluster: size=0x0100, 256)                                  */
   };
        uint8_t   RESERVED_7[1792];             /**< 0180: 0x700 bytes                                                  */
   __IO uint32_t  RXIMR[CAN_MESSAGE_BUFFER_COUNT]; /**< 0880: Rx Individual Mask                                           */
} CAN_Type;

/**
 * @} */ /* End group CAN_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'CAN0' Position & Mask macros                        ----------- */
/* -------------------------------------------------------------------------------- */

