podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK20D7_100p.h
/**
* @addtogroup ETF_Register_Masks_GROUP ETF Register Masks
* @brief Register Masks for ETF
* @{
*/
/* ------- FCR Bit Fields                           ------ */
#define ETF_FCR_EnS0_MASK                        (0x1U)                                              /*!< ETF_FCR.EnS0 Mask                       */
#define ETF_FCR_EnS0_SHIFT                       (0U)                                                /*!< ETF_FCR.EnS0 Position                   */
#define ETF_FCR_EnS0(x)                          (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< ETF_FCR.EnS0 Field                      */
#define ETF_FCR_EnS1_MASK                        (0x2U)                                              /*!< ETF_FCR.EnS1 Mask                       */
#define ETF_FCR_EnS1_SHIFT                       (1U)                                                /*!< ETF_FCR.EnS1 Position                   */
#define ETF_FCR_EnS1(x)                          (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< ETF_FCR.EnS1 Field                      */
#define ETF_FCR_EnS2_MASK                        (0x4U)                                              /*!< ETF_FCR.EnS2 Mask                       */
#define ETF_FCR_EnS2_SHIFT                       (2U)                                                /*!< ETF_FCR.EnS2 Position                   */
#define ETF_FCR_EnS2(x)                          (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< ETF_FCR.EnS2 Field                      */
#define ETF_FCR_EnS3_MASK                        (0x8U)                                              /*!< ETF_FCR.EnS3 Mask                       */
#define ETF_FCR_EnS3_SHIFT                       (3U)                                                /*!< ETF_FCR.EnS3 Position                   */
#define ETF_FCR_EnS3(x)                          (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< ETF_FCR.EnS3 Field                      */
#define ETF_FCR_EnS4_MASK                        (0x10U)                                             /*!< ETF_FCR.EnS4 Mask                       */
#define ETF_FCR_EnS4_SHIFT                       (4U)                                                /*!< ETF_FCR.EnS4 Position                   */
#define ETF_FCR_EnS4(x)                          (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< ETF_FCR.EnS4 Field                      */
#define ETF_FCR_EnS5_MASK                        (0x20U)                                             /*!< ETF_FCR.EnS5 Mask                       */
#define ETF_FCR_EnS5_SHIFT                       (5U)                                                /*!< ETF_FCR.EnS5 Position                   */
#define ETF_FCR_EnS5(x)                          (((uint32_t)(((uint32_t)(x))<<5U))&0x20UL)          /*!< ETF_FCR.EnS5 Field                      */
#define ETF_FCR_EnS6_MASK                        (0x40U)                                             /*!< ETF_FCR.EnS6 Mask                       */
#define ETF_FCR_EnS6_SHIFT                       (6U)                                                /*!< ETF_FCR.EnS6 Position                   */
#define ETF_FCR_EnS6(x)                          (((uint32_t)(((uint32_t)(x))<<6U))&0x40UL)          /*!< ETF_FCR.EnS6 Field                      */
#define ETF_FCR_EnS7_MASK                        (0x80U)                                             /*!< ETF_FCR.EnS7 Mask                       */
#define ETF_FCR_EnS7_SHIFT                       (7U)                                                /*!< ETF_FCR.EnS7 Position                   */
#define ETF_FCR_EnS7(x)                          (((uint32_t)(((uint32_t)(x))<<7U))&0x80UL)          /*!< ETF_FCR.EnS7 Field                      */
#define ETF_FCR_HT_MASK                          (0xF00U)                                            /*!< ETF_FCR.HT Mask                         */
#define ETF_FCR_HT_SHIFT                         (8U)                                                /*!< ETF_FCR.HT Position                     */
#define ETF_FCR_HT(x)                            (((uint32_t)(((uint32_t)(x))<<8U))&0xF00UL)         /*!< ETF_FCR.HT Field                        */
/* ------- PCR Bit Fields                           ------ */
#define ETF_PCR_PriPort0_MASK                    (0x7U)                                              /*!< ETF_PCR.PriPort0 Mask                   */
#define ETF_PCR_PriPort0_SHIFT                   (0U)                                                /*!< ETF_PCR.PriPort0 Position               */
#define ETF_PCR_PriPort0(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0x7UL)           /*!< ETF_PCR.PriPort0 Field                  */
#define ETF_PCR_PriPort1_MASK                    (0x38U)                                             /*!< ETF_PCR.PriPort1 Mask                   */
#define ETF_PCR_PriPort1_SHIFT                   (3U)                                                /*!< ETF_PCR.PriPort1 Position               */
#define ETF_PCR_PriPort1(x)                      (((uint32_t)(((uint32_t)(x))<<3U))&0x38UL)          /*!< ETF_PCR.PriPort1 Field                  */
#define ETF_PCR_PriPort2_MASK                    (0x1C0U)                                            /*!< ETF_PCR.PriPort2 Mask                   */
#define ETF_PCR_PriPort2_SHIFT                   (6U)                                                /*!< ETF_PCR.PriPort2 Position               */
#define ETF_PCR_PriPort2(x)                      (((uint32_t)(((uint32_t)(x))<<6U))&0x1C0UL)         /*!< ETF_PCR.PriPort2 Field                  */
#define ETF_PCR_PriPort3_MASK                    (0xE00U)                                            /*!< ETF_PCR.PriPort3 Mask                   */
#define ETF_PCR_PriPort3_SHIFT                   (9U)                                                /*!< ETF_PCR.PriPort3 Position               */
#define ETF_PCR_PriPort3(x)                      (((uint32_t)(((uint32_t)(x))<<9U))&0xE00UL)         /*!< ETF_PCR.PriPort3 Field                  */
#define ETF_PCR_PriPort4_MASK                    (0x7000U)                                           /*!< ETF_PCR.PriPort4 Mask                   */
#define ETF_PCR_PriPort4_SHIFT                   (12U)                                               /*!< ETF_PCR.PriPort4 Position               */
#define ETF_PCR_PriPort4(x)                      (((uint32_t)(((uint32_t)(x))<<12U))&0x7000UL)       /*!< ETF_PCR.PriPort4 Field                  */
#define ETF_PCR_PriPort5_MASK                    (0x38000U)                                          /*!< ETF_PCR.PriPort5 Mask                   */
#define ETF_PCR_PriPort5_SHIFT                   (15U)                                               /*!< ETF_PCR.PriPort5 Position               */
#define ETF_PCR_PriPort5(x)                      (((uint32_t)(((uint32_t)(x))<<15U))&0x38000UL)      /*!< ETF_PCR.PriPort5 Field                  */
#define ETF_PCR_PriPort6_MASK                    (0x1C0000U)                                         /*!< ETF_PCR.PriPort6 Mask                   */
#define ETF_PCR_PriPort6_SHIFT                   (18U)                                               /*!< ETF_PCR.PriPort6 Position               */
#define ETF_PCR_PriPort6(x)                      (((uint32_t)(((uint32_t)(x))<<18U))&0x1C0000UL)     /*!< ETF_PCR.PriPort6 Field                  */
#define ETF_PCR_PriPort7_MASK                    (0xE00000U)                                         /*!< ETF_PCR.PriPort7 Mask                   */
#define ETF_PCR_PriPort7_SHIFT                   (21U)                                               /*!< ETF_PCR.PriPort7 Position               */
#define ETF_PCR_PriPort7(x)                      (((uint32_t)(((uint32_t)(x))<<21U))&0xE00000UL)     /*!< ETF_PCR.PriPort7 Field                  */
/* ------- ITATBDATA0 Bit Fields                    ------ */
#define ETF_ITATBDATA0_ATDATA0_MASK              (0x1U)                                              /*!< ETF_ITATBDATA0.ATDATA0 Mask             */
#define ETF_ITATBDATA0_ATDATA0_SHIFT             (0U)                                                /*!< ETF_ITATBDATA0.ATDATA0 Position         */
#define ETF_ITATBDATA0_ATDATA0(x)                (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< ETF_ITATBDATA0.ATDATA0 Field            */
#define ETF_ITATBDATA0_ATDATA7_MASK              (0x2U)                                              /*!< ETF_ITATBDATA0.ATDATA7 Mask             */
#define ETF_ITATBDATA0_ATDATA7_SHIFT             (1U)                                                /*!< ETF_ITATBDATA0.ATDATA7 Position         */
#define ETF_ITATBDATA0_ATDATA7(x)                (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< ETF_ITATBDATA0.ATDATA7 Field            */
#define ETF_ITATBDATA0_ATDATA15_MASK             (0x4U)                                              /*!< ETF_ITATBDATA0.ATDATA15 Mask            */
#define ETF_ITATBDATA0_ATDATA15_SHIFT            (2U)                                                /*!< ETF_ITATBDATA0.ATDATA15 Position        */
#define ETF_ITATBDATA0_ATDATA15(x)               (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< ETF_ITATBDATA0.ATDATA15 Field           */
#define ETF_ITATBDATA0_ATDATA23_MASK             (0x8U)                                              /*!< ETF_ITATBDATA0.ATDATA23 Mask            */
#define ETF_ITATBDATA0_ATDATA23_SHIFT            (3U)                                                /*!< ETF_ITATBDATA0.ATDATA23 Position        */
#define ETF_ITATBDATA0_ATDATA23(x)               (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< ETF_ITATBDATA0.ATDATA23 Field           */
#define ETF_ITATBDATA0_ATDATA31_MASK             (0x10U)                                             /*!< ETF_ITATBDATA0.ATDATA31 Mask            */
#define ETF_ITATBDATA0_ATDATA31_SHIFT            (4U)                                                /*!< ETF_ITATBDATA0.ATDATA31 Position        */
#define ETF_ITATBDATA0_ATDATA31(x)               (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< ETF_ITATBDATA0.ATDATA31 Field           */
/* ------- ITATBCTR2 Bit Fields                     ------ */
#define ETF_ITATBCTR2_ATREADY_MASK               (0x1U)                                              /*!< ETF_ITATBCTR2.ATREADY Mask              */
#define ETF_ITATBCTR2_ATREADY_SHIFT              (0U)                                                /*!< ETF_ITATBCTR2.ATREADY Position          */
#define ETF_ITATBCTR2_ATREADY(x)                 (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< ETF_ITATBCTR2.ATREADY Field             */
#define ETF_ITATBCTR2_AFVALID_MASK               (0x2U)                                              /*!< ETF_ITATBCTR2.AFVALID Mask              */
#define ETF_ITATBCTR2_AFVALID_SHIFT              (1U)                                                /*!< ETF_ITATBCTR2.AFVALID Position          */
#define ETF_ITATBCTR2_AFVALID(x)                 (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< ETF_ITATBCTR2.AFVALID Field             */
/* ------- ITATBCTR1 Bit Fields                     ------ */
#define ETF_ITATBCTR1_ATID_MASK                  (0x7FU)                                             /*!< ETF_ITATBCTR1.ATID Mask                 */
#define ETF_ITATBCTR1_ATID_SHIFT                 (0U)                                                /*!< ETF_ITATBCTR1.ATID Position             */
#define ETF_ITATBCTR1_ATID(x)                    (((uint32_t)(((uint32_t)(x))<<0U))&0x7FUL)          /*!< ETF_ITATBCTR1.ATID Field                */
/* ------- ITATBCTR0 Bit Fields                     ------ */
#define ETF_ITATBCTR0_ATVALID_MASK               (0x1U)                                              /*!< ETF_ITATBCTR0.ATVALID Mask              */
#define ETF_ITATBCTR0_ATVALID_SHIFT              (0U)                                                /*!< ETF_ITATBCTR0.ATVALID Position          */
#define ETF_ITATBCTR0_ATVALID(x)                 (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< ETF_ITATBCTR0.ATVALID Field             */
#define ETF_ITATBCTR0_AFREADY_MASK               (0x2U)                                              /*!< ETF_ITATBCTR0.AFREADY Mask              */
#define ETF_ITATBCTR0_AFREADY_SHIFT              (1U)                                                /*!< ETF_ITATBCTR0.AFREADY Position          */
#define ETF_ITATBCTR0_AFREADY(x)                 (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< ETF_ITATBCTR0.AFREADY Field             */
#define ETF_ITATBCTR0_ATBYTES_MASK               (0x300U)                                            /*!< ETF_ITATBCTR0.ATBYTES Mask              */
#define ETF_ITATBCTR0_ATBYTES_SHIFT              (8U)                                                /*!< ETF_ITATBCTR0.ATBYTES Position          */
#define ETF_ITATBCTR0_ATBYTES(x)                 (((uint32_t)(((uint32_t)(x))<<8U))&0x300UL)         /*!< ETF_ITATBCTR0.ATBYTES Field             */
/* ------- ITCTRL Bit Fields                        ------ */
#define ETF_ITCTRL_IntegrationMode_MASK          (0x1U)                                              /*!< ETF_ITCTRL.IntegrationMode Mask         */
#define ETF_ITCTRL_IntegrationMode_SHIFT         (0U)                                                /*!< ETF_ITCTRL.IntegrationMode Position     */
#define ETF_ITCTRL_IntegrationMode(x)            (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< ETF_ITCTRL.IntegrationMode Field        */
/* ------- CLAIMSET Bit Fields                      ------ */
#define ETF_CLAIMSET_CLAIMSET_MASK               (0xFU)                                              /*!< ETF_CLAIMSET.CLAIMSET Mask              */
#define ETF_CLAIMSET_CLAIMSET_SHIFT              (0U)                                                /*!< ETF_CLAIMSET.CLAIMSET Position          */
#define ETF_CLAIMSET_CLAIMSET(x)                 (((uint32_t)(((uint32_t)(x))<<0U))&0xFUL)           /*!< ETF_CLAIMSET.CLAIMSET Field             */
/* ------- CLAIMCLR Bit Fields                      ------ */
#define ETF_CLAIMCLR_CLAIMCLR_MASK               (0xFU)                                              /*!< ETF_CLAIMCLR.CLAIMCLR Mask              */
#define ETF_CLAIMCLR_CLAIMCLR_SHIFT              (0U)                                                /*!< ETF_CLAIMCLR.CLAIMCLR Position          */
#define ETF_CLAIMCLR_CLAIMCLR(x)                 (((uint32_t)(((uint32_t)(x))<<0U))&0xFUL)           /*!< ETF_CLAIMCLR.CLAIMCLR Field             */
/* ------- LAR Bit Fields                           ------ */
#define ETF_LAR_WriteAccessCode_MASK             (0xFFFFFFFFU)                                       /*!< ETF_LAR.WriteAccessCode Mask            */
#define ETF_LAR_WriteAccessCode_SHIFT            (0U)                                                /*!< ETF_LAR.WriteAccessCode Position        */
#define ETF_LAR_WriteAccessCode(x)               (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< ETF_LAR.WriteAccessCode Field           */
/* ------- LSR Bit Fields                           ------ */
#define ETF_LSR_IMP_MASK                         (0x1U)                                              /*!< ETF_LSR.IMP Mask                        */
#define ETF_LSR_IMP_SHIFT                        (0U)                                                /*!< ETF_LSR.IMP Position                    */
#define ETF_LSR_IMP(x)                           (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< ETF_LSR.IMP Field                       */
#define ETF_LSR_STATUS_MASK                      (0x2U)                                              /*!< ETF_LSR.STATUS Mask                     */
#define ETF_LSR_STATUS_SHIFT                     (1U)                                                /*!< ETF_LSR.STATUS Position                 */
#define ETF_LSR_STATUS(x)                        (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< ETF_LSR.STATUS Field                    */
#define ETF_LSR_s8BIT_MASK                       (0x4U)                                              /*!< ETF_LSR.s8BIT Mask                      */
#define ETF_LSR_s8BIT_SHIFT                      (2U)                                                /*!< ETF_LSR.s8BIT Position                  */
#define ETF_LSR_s8BIT(x)                         (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< ETF_LSR.s8BIT Field                     */
/* ------- AUTHSTATUS Bit Fields                    ------ */
#define ETF_AUTHSTATUS_AuthenticationStatus_MASK (0xFFU)                                             /*!< ETF_AUTHSTATUS.AuthenticationStatus Mask*/
#define ETF_AUTHSTATUS_AuthenticationStatus_SHIFT (0U)                                               /*!< ETF_AUTHSTATUS.AuthenticationStatus Position*/
#define ETF_AUTHSTATUS_AuthenticationStatus(x)   (((uint32_t)(((uint32_t)(x))<<0U))&0xFFUL)          /*!< ETF_AUTHSTATUS.AuthenticationStatus Field*/
/* ------- DEVID Bit Fields                         ------ */
#define ETF_DEVID_PORTCOUNT_MASK                 (0xFU)                                              /*!< ETF_DEVID.PORTCOUNT Mask                */
#define ETF_DEVID_PORTCOUNT_SHIFT                (0U)                                                /*!< ETF_DEVID.PORTCOUNT Position            */
#define ETF_DEVID_PORTCOUNT(x)                   (((uint32_t)(((uint32_t)(x))<<0U))&0xFUL)           /*!< ETF_DEVID.PORTCOUNT Field               */
#define ETF_DEVID_PriorityScheme_MASK            (0xF0U)                                             /*!< ETF_DEVID.PriorityScheme Mask           */
#define ETF_DEVID_PriorityScheme_SHIFT           (4U)                                                /*!< ETF_DEVID.PriorityScheme Position       */
#define ETF_DEVID_PriorityScheme(x)              (((uint32_t)(((uint32_t)(x))<<4U))&0xF0UL)          /*!< ETF_DEVID.PriorityScheme Field          */
/* ------- DEVTYPE Bit Fields                       ------ */
#define ETF_DEVTYPE_MajorType_MASK               (0xFU)                                              /*!< ETF_DEVTYPE.MajorType Mask              */
#define ETF_DEVTYPE_MajorType_SHIFT              (0U)                                                /*!< ETF_DEVTYPE.MajorType Position          */
#define ETF_DEVTYPE_MajorType(x)                 (((uint32_t)(((uint32_t)(x))<<0U))&0xFUL)           /*!< ETF_DEVTYPE.MajorType Field             */
#define ETF_DEVTYPE_SubType_MASK                 (0xF0U)                                             /*!< ETF_DEVTYPE.SubType Mask                */
#define ETF_DEVTYPE_SubType_SHIFT                (4U)                                                /*!< ETF_DEVTYPE.SubType Position            */
#define ETF_DEVTYPE_SubType(x)                   (((uint32_t)(((uint32_t)(x))<<4U))&0xF0UL)          /*!< ETF_DEVTYPE.SubType Field               */
/* ------- PIDR4 Bit Fields                         ------ */
#define ETF_PIDR4_JEP106_MASK                    (0xFU)                                              /*!< ETF_PIDR4.JEP106 Mask                   */
#define ETF_PIDR4_JEP106_SHIFT                   (0U)                                                /*!< ETF_PIDR4.JEP106 Position               */
#define ETF_PIDR4_JEP106(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0xFUL)           /*!< ETF_PIDR4.JEP106 Field                  */
#define ETF_PIDR4_c4KB_MASK                      (0xF0U)                                             /*!< ETF_PIDR4.c4KB Mask                     */
#define ETF_PIDR4_c4KB_SHIFT                     (4U)                                                /*!< ETF_PIDR4.c4KB Position                 */
#define ETF_PIDR4_c4KB(x)                        (((uint32_t)(((uint32_t)(x))<<4U))&0xF0UL)          /*!< ETF_PIDR4.c4KB Field                    */
/* ------- PIDR5 Bit Fields                         ------ */
/* ------- PIDR6 Bit Fields                         ------ */
/* ------- PIDR7 Bit Fields                         ------ */
/* ------- PIDR0 Bit Fields                         ------ */
#define ETF_PIDR0_PartNumber_MASK                (0xFFU)                                             /*!< ETF_PIDR0.PartNumber Mask               */
#define ETF_PIDR0_PartNumber_SHIFT               (0U)                                                /*!< ETF_PIDR0.PartNumber Position           */
#define ETF_PIDR0_PartNumber(x)                  (((uint32_t)(((uint32_t)(x))<<0U))&0xFFUL)          /*!< ETF_PIDR0.PartNumber Field              */
/* ------- PIDR1 Bit Fields                         ------ */
#define ETF_PIDR1_PartNumber_MASK                (0xFU)                                              /*!< ETF_PIDR1.PartNumber Mask               */
#define ETF_PIDR1_PartNumber_SHIFT               (0U)                                                /*!< ETF_PIDR1.PartNumber Position           */
#define ETF_PIDR1_PartNumber(x)                  (((uint32_t)(((uint32_t)(x))<<0U))&0xFUL)           /*!< ETF_PIDR1.PartNumber Field              */
#define ETF_PIDR1_JEP106_identity_code_MASK      (0xF0U)                                             /*!< ETF_PIDR1.JEP106_identity_code Mask     */
#define ETF_PIDR1_JEP106_identity_code_SHIFT     (4U)                                                /*!< ETF_PIDR1.JEP106_identity_code Position */
#define ETF_PIDR1_JEP106_identity_code(x)        (((uint32_t)(((uint32_t)(x))<<4U))&0xF0UL)          /*!< ETF_PIDR1.JEP106_identity_code Field    */
/* ------- PIDR2 Bit Fields                         ------ */
#define ETF_PIDR2_JEP106_identity_code_MASK      (0x7U)                                              /*!< ETF_PIDR2.JEP106_identity_code Mask     */
#define ETF_PIDR2_JEP106_identity_code_SHIFT     (0U)                                                /*!< ETF_PIDR2.JEP106_identity_code Position */
#define ETF_PIDR2_JEP106_identity_code(x)        (((uint32_t)(((uint32_t)(x))<<0U))&0x7UL)           /*!< ETF_PIDR2.JEP106_identity_code Field    */
#define ETF_PIDR2_Revision_MASK                  (0xF0U)                                             /*!< ETF_PIDR2.Revision Mask                 */
#define ETF_PIDR2_Revision_SHIFT                 (4U)                                                /*!< ETF_PIDR2.Revision Position             */
#define ETF_PIDR2_Revision(x)                    (((uint32_t)(((uint32_t)(x))<<4U))&0xF0UL)          /*!< ETF_PIDR2.Revision Field                */
/* ------- PIDR3 Bit Fields                         ------ */
#define ETF_PIDR3_CustomerModified_MASK          (0xFU)                                              /*!< ETF_PIDR3.CustomerModified Mask         */
#define ETF_PIDR3_CustomerModified_SHIFT         (0U)                                                /*!< ETF_PIDR3.CustomerModified Position     */
#define ETF_PIDR3_CustomerModified(x)            (((uint32_t)(((uint32_t)(x))<<0U))&0xFUL)           /*!< ETF_PIDR3.CustomerModified Field        */
#define ETF_PIDR3_RevAnd_MASK                    (0xF0U)                                             /*!< ETF_PIDR3.RevAnd Mask                   */
#define ETF_PIDR3_RevAnd_SHIFT                   (4U)                                                /*!< ETF_PIDR3.RevAnd Position               */
#define ETF_PIDR3_RevAnd(x)                      (((uint32_t)(((uint32_t)(x))<<4U))&0xF0UL)          /*!< ETF_PIDR3.RevAnd Field                  */
/* ------- CIDR0 Bit Fields                         ------ */
#define ETF_CIDR0_Preamble_MASK                  (0xFFU)                                             /*!< ETF_CIDR0.Preamble Mask                 */
#define ETF_CIDR0_Preamble_SHIFT                 (0U)                                                /*!< ETF_CIDR0.Preamble Position             */
#define ETF_CIDR0_Preamble(x)                    (((uint32_t)(((uint32_t)(x))<<0U))&0xFFUL)          /*!< ETF_CIDR0.Preamble Field                */
/* ------- CIDR1 Bit Fields                         ------ */
