podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK20D7_100p.h
#define ETF_CIDR1_Preamble_MASK                  (0xFU)                                              /*!< ETF_CIDR1.Preamble Mask                 */
#define ETF_CIDR1_Preamble_SHIFT                 (0U)                                                /*!< ETF_CIDR1.Preamble Position             */
#define ETF_CIDR1_Preamble(x)                    (((uint32_t)(((uint32_t)(x))<<0U))&0xFUL)           /*!< ETF_CIDR1.Preamble Field                */
#define ETF_CIDR1_ComponentClass_MASK            (0xF0U)                                             /*!< ETF_CIDR1.ComponentClass Mask           */
#define ETF_CIDR1_ComponentClass_SHIFT           (4U)                                                /*!< ETF_CIDR1.ComponentClass Position       */
#define ETF_CIDR1_ComponentClass(x)              (((uint32_t)(((uint32_t)(x))<<4U))&0xF0UL)          /*!< ETF_CIDR1.ComponentClass Field          */
/* ------- CIDR2 Bit Fields                         ------ */
#define ETF_CIDR2_Preamble_MASK                  (0xFFU)                                             /*!< ETF_CIDR2.Preamble Mask                 */
#define ETF_CIDR2_Preamble_SHIFT                 (0U)                                                /*!< ETF_CIDR2.Preamble Position             */
#define ETF_CIDR2_Preamble(x)                    (((uint32_t)(((uint32_t)(x))<<0U))&0xFFUL)          /*!< ETF_CIDR2.Preamble Field                */
/* ------- CIDR3 Bit Fields                         ------ */
#define ETF_CIDR3_Preamble_MASK                  (0xFFU)                                             /*!< ETF_CIDR3.Preamble Mask                 */
#define ETF_CIDR3_Preamble_SHIFT                 (0U)                                                /*!< ETF_CIDR3.Preamble Position             */
#define ETF_CIDR3_Preamble(x)                    (((uint32_t)(((uint32_t)(x))<<0U))&0xFFUL)          /*!< ETF_CIDR3.Preamble Field                */
/**
 * @} */ /* End group ETF_Register_Masks_GROUP 
 */

/* ETF - Peripheral instance base addresses */
#define ETF_BasePtr                    0xE0043000UL //!< Peripheral base address
#define ETF                            ((ETF_Type *) ETF_BasePtr) //!< Freescale base pointer
#define ETF_BASE_PTR                   (ETF) //!< Freescale style base pointer
/**
 * @} */ /* End group ETF_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup EWM_Peripheral_access_layer_GROUP EWM Peripheral Access Layer
* @brief C Struct for EWM
* @{
*/

/* ================================================================================ */
/* ================           EWM (file:EWM_INT)                   ================ */
/* ================================================================================ */

/**
 * @brief External Watchdog Monitor
 */
/**
* @addtogroup EWM_structs_GROUP EWM struct
* @brief Struct for EWM
* @{
*/
typedef struct EWM_Type {
   __IO uint8_t   CTRL;                         /**< 0000: Control Register                                             */
   __O  uint8_t   SERV;                         /**< 0001: Service Register                                             */
   __IO uint8_t   CMPL;                         /**< 0002: Compare Low Register                                         */
   __IO uint8_t   CMPH;                         /**< 0003: Compare High Register                                        */
} EWM_Type;

/**
 * @} */ /* End group EWM_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'EWM' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup EWM_Register_Masks_GROUP EWM Register Masks
* @brief Register Masks for EWM
* @{
*/
/* ------- CTRL Bit Fields                          ------ */
#define EWM_CTRL_EWMEN_MASK                      (0x1U)                                              /*!< EWM_CTRL.EWMEN Mask                     */
#define EWM_CTRL_EWMEN_SHIFT                     (0U)                                                /*!< EWM_CTRL.EWMEN Position                 */
#define EWM_CTRL_EWMEN(x)                        (((uint8_t)(((uint8_t)(x))<<0U))&0x1UL)             /*!< EWM_CTRL.EWMEN Field                    */
#define EWM_CTRL_ASSIN_MASK                      (0x2U)                                              /*!< EWM_CTRL.ASSIN Mask                     */
#define EWM_CTRL_ASSIN_SHIFT                     (1U)                                                /*!< EWM_CTRL.ASSIN Position                 */
#define EWM_CTRL_ASSIN(x)                        (((uint8_t)(((uint8_t)(x))<<1U))&0x2UL)             /*!< EWM_CTRL.ASSIN Field                    */
#define EWM_CTRL_INEN_MASK                       (0x4U)                                              /*!< EWM_CTRL.INEN Mask                      */
#define EWM_CTRL_INEN_SHIFT                      (2U)                                                /*!< EWM_CTRL.INEN Position                  */
#define EWM_CTRL_INEN(x)                         (((uint8_t)(((uint8_t)(x))<<2U))&0x4UL)             /*!< EWM_CTRL.INEN Field                     */
#define EWM_CTRL_INTEN_MASK                      (0x8U)                                              /*!< EWM_CTRL.INTEN Mask                     */
#define EWM_CTRL_INTEN_SHIFT                     (3U)                                                /*!< EWM_CTRL.INTEN Position                 */
#define EWM_CTRL_INTEN(x)                        (((uint8_t)(((uint8_t)(x))<<3U))&0x8UL)             /*!< EWM_CTRL.INTEN Field                    */
/* ------- SERV Bit Fields                          ------ */
#define EWM_SERV_SERVICE_MASK                    (0xFFU)                                             /*!< EWM_SERV.SERVICE Mask                   */
#define EWM_SERV_SERVICE_SHIFT                   (0U)                                                /*!< EWM_SERV.SERVICE Position               */
#define EWM_SERV_SERVICE(x)                      (((uint8_t)(((uint8_t)(x))<<0U))&0xFFUL)            /*!< EWM_SERV.SERVICE Field                  */
/* ------- CMPL Bit Fields                          ------ */
#define EWM_CMPL_COMPAREL_MASK                   (0xFFU)                                             /*!< EWM_CMPL.COMPAREL Mask                  */
#define EWM_CMPL_COMPAREL_SHIFT                  (0U)                                                /*!< EWM_CMPL.COMPAREL Position              */
#define EWM_CMPL_COMPAREL(x)                     (((uint8_t)(((uint8_t)(x))<<0U))&0xFFUL)            /*!< EWM_CMPL.COMPAREL Field                 */
/* ------- CMPH Bit Fields                          ------ */
#define EWM_CMPH_COMPAREH_MASK                   (0xFFU)                                             /*!< EWM_CMPH.COMPAREH Mask                  */
#define EWM_CMPH_COMPAREH_SHIFT                  (0U)                                                /*!< EWM_CMPH.COMPAREH Position              */
#define EWM_CMPH_COMPAREH(x)                     (((uint8_t)(((uint8_t)(x))<<0U))&0xFFUL)            /*!< EWM_CMPH.COMPAREH Field                 */
/**
 * @} */ /* End group EWM_Register_Masks_GROUP 
 */

/* EWM - Peripheral instance base addresses */
#define EWM_BasePtr                    0x40061000UL //!< Peripheral base address
#define EWM                            ((EWM_Type *) EWM_BasePtr) //!< Freescale base pointer
#define EWM_BASE_PTR                   (EWM) //!< Freescale style base pointer
#define EWM_IRQS { WDOG_IRQn,  }

/**
 * @} */ /* End group EWM_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup FLEXBUS_Peripheral_access_layer_GROUP FLEXBUS Peripheral Access Layer
* @brief C Struct for FLEXBUS
* @{
*/

/* ================================================================================ */
/* ================           FLEXBUS (file:FLEXBUS)               ================ */
/* ================================================================================ */

/**
 * @brief FlexBus external bus interface
 */
#define FLEXBUS_MEMORY_REGIONS_COUNT 6  /**< Number of Select Regions                           */
/**
* @addtogroup FLEXBUS_structs_GROUP FLEXBUS struct
* @brief Struct for FLEXBUS
* @{
*/
typedef struct FLEXBUS_Type {
   struct {
      __IO uint32_t  CSAR;                      /**< 0000: Chip Select Address Register                                 */
      __IO uint32_t  CSMR;                      /**< 0004: Chip Select Mask Register                                    */
      __IO uint32_t  CSCR;                      /**< 0008: Chip Select Control Register                                 */
   } CS[FLEXBUS_MEMORY_REGIONS_COUNT];          /**< 0000: (cluster: size=0x0048, 72)                                   */
        uint8_t   RESERVED_1[24];               /**< 0048: 0x18 bytes                                                   */
   __IO uint32_t  CSPMCR;                       /**< 0060: Chip Select port Multiplexing Control Register               */
} FLEXBUS_Type;

/**
 * @} */ /* End group FLEXBUS_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'FLEXBUS' Position & Mask macros                     ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup FLEXBUS_Register_Masks_GROUP FLEXBUS Register Masks
* @brief Register Masks for FLEXBUS
* @{
*/
/* ------- CSAR Bit Fields                          ------ */
#define FLEXBUS_CSAR_BA_MASK                     (0xFFFF0000U)                                       /*!< FLEXBUS_CSAR.BA Mask                    */
#define FLEXBUS_CSAR_BA_SHIFT                    (16U)                                               /*!< FLEXBUS_CSAR.BA Position                */
#define FLEXBUS_CSAR_BA(x)                       (((uint32_t)(((uint32_t)(x))<<16U))&0xFFFF0000UL)   /*!< FLEXBUS_CSAR.BA Field                   */
/* ------- CSMR Bit Fields                          ------ */
#define FLEXBUS_CSMR_V_MASK                      (0x1U)                                              /*!< FLEXBUS_CSMR.V Mask                     */
#define FLEXBUS_CSMR_V_SHIFT                     (0U)                                                /*!< FLEXBUS_CSMR.V Position                 */
#define FLEXBUS_CSMR_V(x)                        (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< FLEXBUS_CSMR.V Field                    */
#define FLEXBUS_CSMR_WP_MASK                     (0x100U)                                            /*!< FLEXBUS_CSMR.WP Mask                    */
#define FLEXBUS_CSMR_WP_SHIFT                    (8U)                                                /*!< FLEXBUS_CSMR.WP Position                */
#define FLEXBUS_CSMR_WP(x)                       (((uint32_t)(((uint32_t)(x))<<8U))&0x100UL)         /*!< FLEXBUS_CSMR.WP Field                   */
#define FLEXBUS_CSMR_BAM_MASK                    (0xFFFF0000U)                                       /*!< FLEXBUS_CSMR.BAM Mask                   */
#define FLEXBUS_CSMR_BAM_SHIFT                   (16U)                                               /*!< FLEXBUS_CSMR.BAM Position               */
#define FLEXBUS_CSMR_BAM(x)                      (((uint32_t)(((uint32_t)(x))<<16U))&0xFFFF0000UL)   /*!< FLEXBUS_CSMR.BAM Field                  */
/* ------- CSCR Bit Fields                          ------ */
#define FLEXBUS_CSCR_BSTW_MASK                   (0x8U)                                              /*!< FLEXBUS_CSCR.BSTW Mask                  */
#define FLEXBUS_CSCR_BSTW_SHIFT                  (3U)                                                /*!< FLEXBUS_CSCR.BSTW Position              */
#define FLEXBUS_CSCR_BSTW(x)                     (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< FLEXBUS_CSCR.BSTW Field                 */
#define FLEXBUS_CSCR_BSTR_MASK                   (0x10U)                                             /*!< FLEXBUS_CSCR.BSTR Mask                  */
#define FLEXBUS_CSCR_BSTR_SHIFT                  (4U)                                                /*!< FLEXBUS_CSCR.BSTR Position              */
#define FLEXBUS_CSCR_BSTR(x)                     (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< FLEXBUS_CSCR.BSTR Field                 */
#define FLEXBUS_CSCR_BEM_MASK                    (0x20U)                                             /*!< FLEXBUS_CSCR.BEM Mask                   */
#define FLEXBUS_CSCR_BEM_SHIFT                   (5U)                                                /*!< FLEXBUS_CSCR.BEM Position               */
#define FLEXBUS_CSCR_BEM(x)                      (((uint32_t)(((uint32_t)(x))<<5U))&0x20UL)          /*!< FLEXBUS_CSCR.BEM Field                  */
#define FLEXBUS_CSCR_PS_MASK                     (0xC0U)                                             /*!< FLEXBUS_CSCR.PS Mask                    */
#define FLEXBUS_CSCR_PS_SHIFT                    (6U)                                                /*!< FLEXBUS_CSCR.PS Position                */
#define FLEXBUS_CSCR_PS(x)                       (((uint32_t)(((uint32_t)(x))<<6U))&0xC0UL)          /*!< FLEXBUS_CSCR.PS Field                   */
#define FLEXBUS_CSCR_AA_MASK                     (0x100U)                                            /*!< FLEXBUS_CSCR.AA Mask                    */
#define FLEXBUS_CSCR_AA_SHIFT                    (8U)                                                /*!< FLEXBUS_CSCR.AA Position                */
#define FLEXBUS_CSCR_AA(x)                       (((uint32_t)(((uint32_t)(x))<<8U))&0x100UL)         /*!< FLEXBUS_CSCR.AA Field                   */
#define FLEXBUS_CSCR_BLS_MASK                    (0x200U)                                            /*!< FLEXBUS_CSCR.BLS Mask                   */
#define FLEXBUS_CSCR_BLS_SHIFT                   (9U)                                                /*!< FLEXBUS_CSCR.BLS Position               */
#define FLEXBUS_CSCR_BLS(x)                      (((uint32_t)(((uint32_t)(x))<<9U))&0x200UL)         /*!< FLEXBUS_CSCR.BLS Field                  */
#define FLEXBUS_CSCR_WS_MASK                     (0xFC00U)                                           /*!< FLEXBUS_CSCR.WS Mask                    */
#define FLEXBUS_CSCR_WS_SHIFT                    (10U)                                               /*!< FLEXBUS_CSCR.WS Position                */
#define FLEXBUS_CSCR_WS(x)                       (((uint32_t)(((uint32_t)(x))<<10U))&0xFC00UL)       /*!< FLEXBUS_CSCR.WS Field                   */
#define FLEXBUS_CSCR_WRAH_MASK                   (0x30000U)                                          /*!< FLEXBUS_CSCR.WRAH Mask                  */
#define FLEXBUS_CSCR_WRAH_SHIFT                  (16U)                                               /*!< FLEXBUS_CSCR.WRAH Position              */
#define FLEXBUS_CSCR_WRAH(x)                     (((uint32_t)(((uint32_t)(x))<<16U))&0x30000UL)      /*!< FLEXBUS_CSCR.WRAH Field                 */
#define FLEXBUS_CSCR_RDAH_MASK                   (0xC0000U)                                          /*!< FLEXBUS_CSCR.RDAH Mask                  */
#define FLEXBUS_CSCR_RDAH_SHIFT                  (18U)                                               /*!< FLEXBUS_CSCR.RDAH Position              */
#define FLEXBUS_CSCR_RDAH(x)                     (((uint32_t)(((uint32_t)(x))<<18U))&0xC0000UL)      /*!< FLEXBUS_CSCR.RDAH Field                 */
#define FLEXBUS_CSCR_ASET_MASK                   (0x300000U)                                         /*!< FLEXBUS_CSCR.ASET Mask                  */
#define FLEXBUS_CSCR_ASET_SHIFT                  (20U)                                               /*!< FLEXBUS_CSCR.ASET Position              */
#define FLEXBUS_CSCR_ASET(x)                     (((uint32_t)(((uint32_t)(x))<<20U))&0x300000UL)     /*!< FLEXBUS_CSCR.ASET Field                 */
#define FLEXBUS_CSCR_EXTS_MASK                   (0x400000U)                                         /*!< FLEXBUS_CSCR.EXTS Mask                  */
#define FLEXBUS_CSCR_EXTS_SHIFT                  (22U)                                               /*!< FLEXBUS_CSCR.EXTS Position              */
#define FLEXBUS_CSCR_EXTS(x)                     (((uint32_t)(((uint32_t)(x))<<22U))&0x400000UL)     /*!< FLEXBUS_CSCR.EXTS Field                 */
#define FLEXBUS_CSCR_SWSEN_MASK                  (0x800000U)                                         /*!< FLEXBUS_CSCR.SWSEN Mask                 */
#define FLEXBUS_CSCR_SWSEN_SHIFT                 (23U)                                               /*!< FLEXBUS_CSCR.SWSEN Position             */
#define FLEXBUS_CSCR_SWSEN(x)                    (((uint32_t)(((uint32_t)(x))<<23U))&0x800000UL)     /*!< FLEXBUS_CSCR.SWSEN Field                */
#define FLEXBUS_CSCR_SWS_MASK                    (0xFC000000U)                                       /*!< FLEXBUS_CSCR.SWS Mask                   */
#define FLEXBUS_CSCR_SWS_SHIFT                   (26U)                                               /*!< FLEXBUS_CSCR.SWS Position               */
#define FLEXBUS_CSCR_SWS(x)                      (((uint32_t)(((uint32_t)(x))<<26U))&0xFC000000UL)   /*!< FLEXBUS_CSCR.SWS Field                  */
/* ------- CSPMCR Bit Fields                        ------ */
#define FLEXBUS_CSPMCR_GROUP5_MASK               (0xF000U)                                           /*!< FLEXBUS_CSPMCR.GROUP5 Mask              */
#define FLEXBUS_CSPMCR_GROUP5_SHIFT              (12U)                                               /*!< FLEXBUS_CSPMCR.GROUP5 Position          */
#define FLEXBUS_CSPMCR_GROUP5(x)                 (((uint32_t)(((uint32_t)(x))<<12U))&0xF000UL)       /*!< FLEXBUS_CSPMCR.GROUP5 Field             */
#define FLEXBUS_CSPMCR_GROUP4_MASK               (0xF0000U)                                          /*!< FLEXBUS_CSPMCR.GROUP4 Mask              */
#define FLEXBUS_CSPMCR_GROUP4_SHIFT              (16U)                                               /*!< FLEXBUS_CSPMCR.GROUP4 Position          */
#define FLEXBUS_CSPMCR_GROUP4(x)                 (((uint32_t)(((uint32_t)(x))<<16U))&0xF0000UL)      /*!< FLEXBUS_CSPMCR.GROUP4 Field             */
#define FLEXBUS_CSPMCR_GROUP3_MASK               (0xF00000U)                                         /*!< FLEXBUS_CSPMCR.GROUP3 Mask              */
#define FLEXBUS_CSPMCR_GROUP3_SHIFT              (20U)                                               /*!< FLEXBUS_CSPMCR.GROUP3 Position          */
#define FLEXBUS_CSPMCR_GROUP3(x)                 (((uint32_t)(((uint32_t)(x))<<20U))&0xF00000UL)     /*!< FLEXBUS_CSPMCR.GROUP3 Field             */
#define FLEXBUS_CSPMCR_GROUP2_MASK               (0xF000000U)                                        /*!< FLEXBUS_CSPMCR.GROUP2 Mask              */
#define FLEXBUS_CSPMCR_GROUP2_SHIFT              (24U)                                               /*!< FLEXBUS_CSPMCR.GROUP2 Position          */
#define FLEXBUS_CSPMCR_GROUP2(x)                 (((uint32_t)(((uint32_t)(x))<<24U))&0xF000000UL)    /*!< FLEXBUS_CSPMCR.GROUP2 Field             */
#define FLEXBUS_CSPMCR_GROUP1_MASK               (0xF0000000U)                                       /*!< FLEXBUS_CSPMCR.GROUP1 Mask              */
#define FLEXBUS_CSPMCR_GROUP1_SHIFT              (28U)                                               /*!< FLEXBUS_CSPMCR.GROUP1 Position          */
#define FLEXBUS_CSPMCR_GROUP1(x)                 (((uint32_t)(((uint32_t)(x))<<28U))&0xF0000000UL)   /*!< FLEXBUS_CSPMCR.GROUP1 Field             */
/**
 * @} */ /* End group FLEXBUS_Register_Masks_GROUP 
 */

/* FLEXBUS - Peripheral instance base addresses */
#define FLEXBUS_BasePtr                0x4000C000UL //!< Peripheral base address
#define FLEXBUS                        ((FLEXBUS_Type *) FLEXBUS_BasePtr) //!< Freescale base pointer
#define FLEXBUS_BASE_PTR               (FLEXBUS) //!< Freescale style base pointer
/**
 * @} */ /* End group FLEXBUS_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup FMC_Peripheral_access_layer_GROUP FMC Peripheral Access Layer
* @brief C Struct for FMC
* @{
*/

/* ================================================================================ */
/* ================           FMC (file:FMC_MK10D7)                ================ */
/* ================================================================================ */

