podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK20D7_100p.h
#define FMC_TAGVD4_valid(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< FMC_TAGVD4.valid Field                  */
#define FMC_TAGVD4_tag_MASK                      (0x7FFC0U)                                          /*!< FMC_TAGVD4.tag Mask                     */
#define FMC_TAGVD4_tag_SHIFT                     (6U)                                                /*!< FMC_TAGVD4.tag Position                 */
#define FMC_TAGVD4_tag(x)                        (((uint32_t)(((uint32_t)(x))<<6U))&0x7FFC0UL)       /*!< FMC_TAGVD4.tag Field                    */
/* ------- S5 Bit Fields                            ------ */
#define FMC_TAGVD5_valid_MASK                    (0x1U)                                              /*!< FMC_TAGVD5.valid Mask                   */
#define FMC_TAGVD5_valid_SHIFT                   (0U)                                                /*!< FMC_TAGVD5.valid Position               */
#define FMC_TAGVD5_valid(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< FMC_TAGVD5.valid Field                  */
#define FMC_TAGVD5_tag_MASK                      (0x7FFC0U)                                          /*!< FMC_TAGVD5.tag Mask                     */
#define FMC_TAGVD5_tag_SHIFT                     (6U)                                                /*!< FMC_TAGVD5.tag Position                 */
#define FMC_TAGVD5_tag(x)                        (((uint32_t)(((uint32_t)(x))<<6U))&0x7FFC0UL)       /*!< FMC_TAGVD5.tag Field                    */
/* ------- S6 Bit Fields                            ------ */
#define FMC_TAGVD6_valid_MASK                    (0x1U)                                              /*!< FMC_TAGVD6.valid Mask                   */
#define FMC_TAGVD6_valid_SHIFT                   (0U)                                                /*!< FMC_TAGVD6.valid Position               */
#define FMC_TAGVD6_valid(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< FMC_TAGVD6.valid Field                  */
#define FMC_TAGVD6_tag_MASK                      (0x7FFC0U)                                          /*!< FMC_TAGVD6.tag Mask                     */
#define FMC_TAGVD6_tag_SHIFT                     (6U)                                                /*!< FMC_TAGVD6.tag Position                 */
#define FMC_TAGVD6_tag(x)                        (((uint32_t)(((uint32_t)(x))<<6U))&0x7FFC0UL)       /*!< FMC_TAGVD6.tag Field                    */
/* ------- S7 Bit Fields                            ------ */
#define FMC_TAGVD7_valid_MASK                    (0x1U)                                              /*!< FMC_TAGVD7.valid Mask                   */
#define FMC_TAGVD7_valid_SHIFT                   (0U)                                                /*!< FMC_TAGVD7.valid Position               */
#define FMC_TAGVD7_valid(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< FMC_TAGVD7.valid Field                  */
#define FMC_TAGVD7_tag_MASK                      (0x7FFC0U)                                          /*!< FMC_TAGVD7.tag Mask                     */
#define FMC_TAGVD7_tag_SHIFT                     (6U)                                                /*!< FMC_TAGVD7.tag Position                 */
#define FMC_TAGVD7_tag(x)                        (((uint32_t)(((uint32_t)(x))<<6U))&0x7FFC0UL)       /*!< FMC_TAGVD7.tag Field                    */
/* ------- S0U Bit Fields                           ------ */
#define FMC_DATAWU_data_MASK                     (0xFFFFFFFFU)                                       /*!< FMC_DATAWU.data Mask                    */
#define FMC_DATAWU_data_SHIFT                    (0U)                                                /*!< FMC_DATAWU.data Position                */
#define FMC_DATAWU_data(x)                       (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< FMC_DATAWU.data Field                   */
/* ------- S0L Bit Fields                           ------ */
#define FMC_DATAWL_data_MASK                     (0xFFFFFFFFU)                                       /*!< FMC_DATAWL.data Mask                    */
#define FMC_DATAWL_data_SHIFT                    (0U)                                                /*!< FMC_DATAWL.data Position                */
#define FMC_DATAWL_data(x)                       (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< FMC_DATAWL.data Field                   */
/* ------- S1U Bit Fields                           ------ */
#define FMC_DATAW1U_data_MASK                    (0xFFFFFFFFU)                                       /*!< FMC_DATAW1U.data Mask                   */
#define FMC_DATAW1U_data_SHIFT                   (0U)                                                /*!< FMC_DATAW1U.data Position               */
#define FMC_DATAW1U_data(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< FMC_DATAW1U.data Field                  */
/* ------- S1L Bit Fields                           ------ */
#define FMC_DATAW1L_data_MASK                    (0xFFFFFFFFU)                                       /*!< FMC_DATAW1L.data Mask                   */
#define FMC_DATAW1L_data_SHIFT                   (0U)                                                /*!< FMC_DATAW1L.data Position               */
#define FMC_DATAW1L_data(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< FMC_DATAW1L.data Field                  */
/* ------- S2U Bit Fields                           ------ */
#define FMC_DATAW2U_data_MASK                    (0xFFFFFFFFU)                                       /*!< FMC_DATAW2U.data Mask                   */
#define FMC_DATAW2U_data_SHIFT                   (0U)                                                /*!< FMC_DATAW2U.data Position               */
#define FMC_DATAW2U_data(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< FMC_DATAW2U.data Field                  */
/* ------- S2L Bit Fields                           ------ */
#define FMC_DATAW2L_data_MASK                    (0xFFFFFFFFU)                                       /*!< FMC_DATAW2L.data Mask                   */
#define FMC_DATAW2L_data_SHIFT                   (0U)                                                /*!< FMC_DATAW2L.data Position               */
#define FMC_DATAW2L_data(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< FMC_DATAW2L.data Field                  */
/* ------- S3U Bit Fields                           ------ */
#define FMC_DATAW3U_data_MASK                    (0xFFFFFFFFU)                                       /*!< FMC_DATAW3U.data Mask                   */
#define FMC_DATAW3U_data_SHIFT                   (0U)                                                /*!< FMC_DATAW3U.data Position               */
#define FMC_DATAW3U_data(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< FMC_DATAW3U.data Field                  */
/* ------- S3L Bit Fields                           ------ */
#define FMC_DATAW3L_data_MASK                    (0xFFFFFFFFU)                                       /*!< FMC_DATAW3L.data Mask                   */
#define FMC_DATAW3L_data_SHIFT                   (0U)                                                /*!< FMC_DATAW3L.data Position               */
#define FMC_DATAW3L_data(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< FMC_DATAW3L.data Field                  */
/* ------- S4U Bit Fields                           ------ */
#define FMC_DATAW4U_data_MASK                    (0xFFFFFFFFU)                                       /*!< FMC_DATAW4U.data Mask                   */
#define FMC_DATAW4U_data_SHIFT                   (0U)                                                /*!< FMC_DATAW4U.data Position               */
#define FMC_DATAW4U_data(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< FMC_DATAW4U.data Field                  */
/* ------- S4L Bit Fields                           ------ */
#define FMC_DATAW4L_data_MASK                    (0xFFFFFFFFU)                                       /*!< FMC_DATAW4L.data Mask                   */
#define FMC_DATAW4L_data_SHIFT                   (0U)                                                /*!< FMC_DATAW4L.data Position               */
#define FMC_DATAW4L_data(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< FMC_DATAW4L.data Field                  */
/* ------- S5U Bit Fields                           ------ */
#define FMC_DATAW5U_data_MASK                    (0xFFFFFFFFU)                                       /*!< FMC_DATAW5U.data Mask                   */
#define FMC_DATAW5U_data_SHIFT                   (0U)                                                /*!< FMC_DATAW5U.data Position               */
#define FMC_DATAW5U_data(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< FMC_DATAW5U.data Field                  */
/* ------- S5L Bit Fields                           ------ */
#define FMC_DATAW5L_data_MASK                    (0xFFFFFFFFU)                                       /*!< FMC_DATAW5L.data Mask                   */
#define FMC_DATAW5L_data_SHIFT                   (0U)                                                /*!< FMC_DATAW5L.data Position               */
#define FMC_DATAW5L_data(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< FMC_DATAW5L.data Field                  */
/* ------- S6U Bit Fields                           ------ */
#define FMC_DATAW6U_data_MASK                    (0xFFFFFFFFU)                                       /*!< FMC_DATAW6U.data Mask                   */
#define FMC_DATAW6U_data_SHIFT                   (0U)                                                /*!< FMC_DATAW6U.data Position               */
#define FMC_DATAW6U_data(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< FMC_DATAW6U.data Field                  */
/* ------- S6L Bit Fields                           ------ */
#define FMC_DATAW6L_data_MASK                    (0xFFFFFFFFU)                                       /*!< FMC_DATAW6L.data Mask                   */
#define FMC_DATAW6L_data_SHIFT                   (0U)                                                /*!< FMC_DATAW6L.data Position               */
#define FMC_DATAW6L_data(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< FMC_DATAW6L.data Field                  */
/* ------- S7U Bit Fields                           ------ */
#define FMC_DATAW7U_data_MASK                    (0xFFFFFFFFU)                                       /*!< FMC_DATAW7U.data Mask                   */
#define FMC_DATAW7U_data_SHIFT                   (0U)                                                /*!< FMC_DATAW7U.data Position               */
#define FMC_DATAW7U_data(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< FMC_DATAW7U.data Field                  */
/* ------- S7L Bit Fields                           ------ */
#define FMC_DATAW7L_data_MASK                    (0xFFFFFFFFU)                                       /*!< FMC_DATAW7L.data Mask                   */
#define FMC_DATAW7L_data_SHIFT                   (0U)                                                /*!< FMC_DATAW7L.data Position               */
#define FMC_DATAW7L_data(x)                      (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< FMC_DATAW7L.data Field                  */
/**
 * @} */ /* End group FMC_Register_Masks_GROUP 
 */

/* FMC - Peripheral instance base addresses */
#define FMC_BasePtr                    0x4001F000UL //!< Peripheral base address
#define FMC                            ((FMC_Type *) FMC_BasePtr) //!< Freescale base pointer
#define FMC_BASE_PTR                   (FMC) //!< Freescale style base pointer
/**
 * @} */ /* End group FMC_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup FPB_Peripheral_access_layer_GROUP FPB Peripheral Access Layer
* @brief C Struct for FPB
* @{
*/

/* ================================================================================ */
/* ================           FPB (file:FPB)                       ================ */
/* ================================================================================ */

/**
 * @brief Flash Patch and Breakpoint Unit
 */
/**
* @addtogroup FPB_structs_GROUP FPB struct
* @brief Struct for FPB
* @{
*/
typedef struct FPB_Type {
   __IO uint32_t  CTRL;                         /**< 0000: FlashPatch Control Register                                  */
   __IO uint32_t  REMAP;                        /**< 0004: FlashPatch Remap Register                                    */
   __IO uint32_t  COMP[8];                      /**< 0008: FlashPatch Comparator Register                               */
        uint8_t   RESERVED_0[4008];             /**< 0028: 0xFA8 bytes                                                  */
   __I  uint32_t  PID4;                         /**< 0FD0: Peripheral Identification Register 4                         */
   __I  uint32_t  PID5;                         /**< 0FD4: Peripheral Identification Register 5                         */
   __I  uint32_t  PID6;                         /**< 0FD8: Peripheral Identification Register 6                         */
   __I  uint32_t  PID7;                         /**< 0FDC: Peripheral Identification Register 7                         */
   __I  uint32_t  PID0;                         /**< 0FE0: Peripheral Identification Register 0                         */
   __I  uint32_t  PID1;                         /**< 0FE4: Peripheral Identification Register 1                         */
   __I  uint32_t  PID2;                         /**< 0FE8: Peripheral Identification Register 2                         */
   __I  uint32_t  PID3;                         /**< 0FEC: Peripheral Identification Register 3                         */
   __I  uint32_t  CID0;                         /**< 0FF0: Component Identification Register 0                          */
   __I  uint32_t  CID1;                         /**< 0FF4: Component Identification Register 1                          */
   __I  uint32_t  CID2;                         /**< 0FF8: Component Identification Register 2                          */
   __I  uint32_t  CID3;                         /**< 0FFC: Component Identification Register 3                          */
} FPB_Type;

/**
 * @} */ /* End group FPB_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'FPB' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */

